Diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ОтпускаСотрудниковПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	Сутки = 60 * 60 * 24;
	ДатаНачалаОтпуска = НачалоДня(ТекущаяСтрока.ДатаНачала);
	ДатаОкончанияОтпуска = НачалоДня(ТекущаяСтрока.ДатаОкончания);
	КоличествоДнейОтпуска = (ДатаОкончанияОтпуска - ДатаНачалаОтпуска) / Сутки + 1;
	ТекущаяСтрока.КоличествоДнейОтпуска = КоличествоДнейОтпуска;
	
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Сутки = 60 * 60 * 24;
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		
		ДатаНачалаОтпуска = НачалоДня(Строка.ДатаНачала);
		ДатаОкончанияОтпуска = НачалоДня(Строка.ДатаОкончания);
		Строка.КоличествоДнейОтпуска = (ДатаОкончанияОтпуска - ДатаНачалаОтпуска) / Сутки + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьДанныеВоВременноеХранилище()
	
	Структура = Новый Структура();
	Структура.Вставить("Год", Объект.Год);
	Структура.Вставить("ТаблицаОтпусков", Объект.ОтпускаСотрудников.Выгрузить());
	
	Данные = ПоместитьВоВременноеХранилище(Структура, Новый УникальныйИдентификатор);
	
	Возврат Данные;
	
КонецФункции

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Адрес", ПоместитьДанныеВоВременноеХранилище());
	
	Имя = ПолучитьПолноеИмяФормы("АнализГрафика");
	
	ОткрытьФорму(Имя, СтруктураПараметров, ЭтотОбъект);
КонецПроцедуры 

&НаКлиенте
Функция ПолучитьПолноеИмяФормы(ИмяФормы)
	
	 СимволТочка = ".";
	 ПозицияТочки = СтрДлина(ЭтаФорма.ИмяФормы);
	 
	 Пока Сред(ЭтаФорма.ИмяФормы, ПозицияТочки, 1) <> СимволТочка Цикл
		 ПозицияТочки = ПозицияТочки - 1;
	 КонецЦикла;
	 
	 Возврат Лев(ЭтаФорма.ИмяФормы, ПозицияТочки) + ИмяФормы;
	 
КонецФункции
